# IsValidViewScale Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsValidViewScale Method
View Class See Also
---
This validator checks that the view scale is in the allowable range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidViewScale(
	int viewScale
)
```

Visual Basic
---
```text
Public Shared Function IsValidViewScale ( _
	viewScale As Integer _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidViewScale(
	int viewScale
)
```

# ### Parameters
viewScale
    Type: System..::..Int32 The denominator X in the view scale 1/X.
# ### Return Value
True if the view scale is within the allowable range, false otherwise.
# Remarks
The view scale is expressed as 1/X, where X is an integer the range 1 to 24,000.
# See Also
View Class
Autodesk.Revit.DB Namespace